tiborsimon/embedded-tdd-headers/pic/pic18/pic18f87j72_tdd.h
#define SEGEN25                       1091
#define SE26                          1092
#define SEGEN26                       1093
#define SE27                          1094
#define SEGEN27                       1095
#define SE28                          1096
#define SEGEN28                       1097
#define SEGEN29                       1098
#define SE29                          1099
#define SE30                          1100
#define SEGEN30                       1101
#define SEGEN31                       1102
#define SE31                          1103
#define SEGEN32                       1104
#define SE32                          1105
#define LCDSE4                        1106
#define SEG0COM0                      1107
#define LCDDATA0                      1108
#define S00C0                         1109
#define S0C0                          1110
#define S01C0                         1111
#define SEG1COM0                      1112
#define S1C0                          1113
#define S02C0                         1114
#define S2C0                          1115
#define SEG2COM0                      1116
#define S03C0                         1117
#define SEG3COM0                      1118
#define S3C0                          1119
#define SEG4COM0                      1120
#define S4C0                          1121
#define S04C0                         1122
#define S5C0                          1123
#define S05C0                         1124
#define SEG5COM0                      1125
#define SEG6COM0                      1126
#define S6C0                          1127
#define S06C0                         1128
#define SEG7COM0                      1129
#define S7C0                          1130
#define S07C0                         1131
#define S08C0                         1132
#define LCDDATA1                      1133
#define S8C0                          1134
#define SEG8COM0                      1135
#define SEG9COM0                      1136
#define S09C0                         1137
#define S9C0                          1138
#define S10C0                         1139
#define SEG10COM0                     1140
#define S11C0                         1141
#define SEG11COM0                     1142
#define S12C0                         1143
#define SEG12COM0                     1144
#define S13C0                         1145
#define SEG13COM0                     1146
#define S14C0                         1147
#define SEG14COM0                     1148
#define SEG15COM0                     1149
#define S15C0                         1150
#define LCDDATA2                      1151
#define S16C0                         1152
#define SEG16COM0                     1153
#define SEG17COM0                     1154
#define S17C0                         1155
#define SEG18COM0                     1156
#define S18C0                         1157
#define S19C0                         1158
#define SEG19COM0                     1159
#define S20C0                         1160
#define SEG20COM0                     1161
#define S21C0                         1162
#define SEG21COM0                     1163
#define SEG22COM0                     1164
#define S22C0                         1165
#define S23C0                         1166
#define SEG23COM0                     1167
#define LCDDATA3                      1168
#define S24C0                         1169
#define SEG24COM0                     1170
#define S25C0                         1171
#define SEG25COM0                     1172
#define S26C0                         1173
#define SEG26COM0                     1174
#define SEG27COM0                     1175
#define S27C0                         1176
#define SEG28COM0                     1177
#define S28C0                         1178
#define SEG29COM0                     1179
#define S29C0                         1180
#define S30C0                         1181
#define SEG30COM0                     1182
#define SEG31COM0                     1183
#define S31C0                         1184
#define S32C0                         1185
#define LCDDATA4                      1186
#define SEG32COM0                     1187
#define SEG33COM0                     1188
#define S33C0                         1189
#define S34C0                         1190
#define SEG34COM0                     1191
#define S35C0                         1192
#define SEG35COM0                     1193
#define S36C0                         1194
#define SEG36COM0                     1195
#define SEG37COM0                     1196
#define S37C0                         1197
#define S38C0                         1198
#define SEG38COM0                     1199
#define SEG39COM0                     1200
#define S39C0                         1201
#define ADCON2                        1202
#define ADCS0                         1203
#define ADCS                          1204
#define ADCS1                         1205
#define ADCS2                         1206
#define ACQT0                         1207
#define ACQT                          1208
#define ACQT1                         1209
#define ACQT2                         1210
#define ADFM                          1211
#define ADCON1                        1212
#define PCFG0                         1213
#define PCFG                          1214
#define PCFG1                         1215
#define PCFG2                         1216
#define CHSN3                         1217
#define PCFG3                         1218
#define VCFG                          1219
#define VCFG01                        1220
#define ADCON1_VCFG0                  1221
#define VCFG11                        1222
#define ADCON1_VCFG1                  1223
#define TRIGSEL                       1224
#define ADCON0                        1225
#define ADON                          1226
#define nDONE                         1227
#define GO_nDONE                      1228
#define NOT_DONE                      1229
#define GODONE                        1230
#define GO_DONE                       1231
#define DONE                          1232
#define GO                            1233
#define GO_NOT_DONE                   1234
#define CHS                           1235
#define CHS0                          1236
#define CHS1                          1237
#define CHS2                          1238
#define CHS3                          1239
#define ADCON0_VCFG0                  1240
#define ADCAL                         1241
#define ADCON0_VCFG1                  1242
#define ADRESL                        1243
#define ADRESH                        1244
#define SSP1CON2                      1245
#define SEN1                          1246
#define SEN                           1247
#define ADMSK11                       1248
#define RSEN1                         1249
#define RSEN                          1250
#define ADMSK1                        1251
#define PEN                           1252
#define ADMSK21                       1253
#define PEN1                          1254
#define ADMSK2                        1255
#define ADMSK31                       1256
#define RCEN                          1257
#define RCEN1                         1258
#define ADMSK3                        1259
#define ACKEN                         1260
#define ACKEN1                        1261
#define ADMSK41                       1262
#define ADMSK4                        1263
#define ACKDT1                        1264
#define ADMSK51                       1265
#define ADMSK5                        1266
#define ACKDT                         1267
#define ACKSTAT                       1268
#define ACKSTAT1                      1269
#define GCEN                          1270
#define GCEN1                         1271
#define SSP1CON1                      1272
#define SSPM0                         1273
#define SSPM                          1274
#define SSPM01                        1275
#define SSPM1                         1276
#define SSPM11                        1277
#define SSPM2                         1278
#define SSPM21                        1279
#define SSPM31                        1280
#define SSPM3                         1281
#define CKP                           1282
#define CKP1                          1283
#define SSPEN                         1284
#define SSPEN1                        1285
#define SSPOV1                        1286
#define SSPOV                         1287
#define WCOL1                         1288
#define WCOL                          1289
#define SSP1STAT                      1290
#define BF                            1291
#define BF1                           1292
#define UA1                           1293
#define UA                            1294
#define R_NOT_W                       1295
#define READ_WRITE                    1296
#define RW1                           1297
#define NOT_W                         1298
#define I2C_READ                      1299
#define nW                            1300
#define RW                            1301
#define nWRITE                        1302
#define R                             1303
#define NOT_WRITE                     1304
#define R_nW                          1305
#define R_W                           1306
#define START                         1307
#define START1                        1308
#define S                             1309
#define I2C_START                     1310
#define STOP                          1311
#define STOP1                         1312
#define I2C_STOP                      1313
#define P                             1314
#define NOT_A                         1315
#define nA                            1316
#define D_A                           1317
#define D_nA                          1318
#define D                             1319
#define DA1                           1320
#define DA                            1321
#define DATA_ADDRESS                  1322
#define D_NOT_A                       1323
#define NOT_ADDRESS                   1324
#define nADDRESS                      1325
#define I2C_DAT                       1326
#define CKE                           1327
#define CKE1                          1328
#define SMP                           1329
#define SMP1                          1330
#define SSP1ADD                       1331
#define SSP1ADD_MSK0                  1332
#define MSK01                         1333
#define SSPADD                        1334
#define SSP1ADD_MSK1                  1335
#define MSK11                         1336
#define SSP1ADD_MSK2                  1337
#define MSK21                         1338
#define MSK31                         1339
#define SSP1ADD_MSK3                  1340
#define SSP1ADD_MSK4                  1341
#define MSK41                         1342
#define MSK51                         1343
#define SSP1ADD_MSK5                  1344
#define MSK61                         1345
#define SSP1ADD_MSK6                  1346
#define SSP1ADD_MSK7                  1347
#define MSK71                         1348
#define SSP1BUF                       1349
#define SSPBUF                        1350
#define T2CON                         1351
#define T2CKPS0                       1352
#define T2CKPS                        1353
#define T2CKPS1                       1354
#define TMR2ON                        1355
#define T2OUTPS0                      1356
#define T2OUTPS                       1357
#define T2OUTPS1                      1358
#define T2OUTPS2                      1359
#define T2OUTPS3                      1360
#define WM0                           1361
#define PR2                           1362
#define WM1                           1363
#define WAIT0                         1364
#define WAIT1                         1365
#define EBDIS                         1366
#define TMR2                          1367
#define T1CON                         1368
#define TMR1ON                        1369
#define TMR1CS                        1370
#define NOT_T1SYNC                    1371
#define T1SYNC                        1372
#define nT1SYNC                       1373
#define T1INSYNC                      1374
#define T1OSCEN                       1375
#define SOSCEN                        1376
#define T1CKPS0                       1377
#define T1CKPS                        1378
#define T1CKPS1                       1379
#define T1RUN                         1380
#define T1RD16                        1381
#define T1CON_RD16                    1382
#define TMR1L                         1383
#define TMR1H                         1384
#define RCON                          1385
#define BOR                           1386
#define NOT_BOR                       1387
#define nBOR                          1388
#define POR                           1389
#define nPOR                          1390
#define NOT_POR                       1391
#define PD                            1392
#define nPD                           1393
#define NOT_PD                        1394
#define nTO                           1395
#define TO                            1396
#define NOT_TO                        1397
#define nRI                           1398
#define NOT_RI                        1399
#define RI                            1400
#define NOT_CM                        1401
#define RCON_CM                       1402
#define nCM                           1403
#define IPEN                          1404
#define WDTCON                        1405
#define SWDTE                         1406
#define SWDTEN                        1407
#define REGSLP                        1408
#define LCDREG                        1409
#define CKSEL                         1410
#define CKSEL0                        1411
#define CKSEL1                        1412
#define MODE13                        1413
#define BIAS0                         1414
#define BIAS                          1415
#define BIAS1                         1416
#define BIAS2                         1417
#define CPEN                          1418
#define OSCCON                        1419
#define SCS0                          1420
#define SCS                           1421
#define SCS1                          1422
#define IOFS                          1423
#define OSTS                          1424
#define IRCF                          1425
#define IRCF0                         1426
#define IRCF1                         1427
#define IRCF2                         1428
#define IDLEN                         1429
#define T0CON                         1430
#define T0PS                          1431
#define T0PS0                         1432
#define T0PS1                         1433
#define T0PS2                         1434
#define PSA                           1435
#define T0SE                          1436
#define T0CS                          1437
#define T08BIT                        1438
#define TMR0ON                        1439
#define TMR0L                         1440
#define TMR0H                         1441
#define STATUS                        1442
#define C                             1443
#define CARRY                         1444
#define DC                            1445
#define ZERO                          1446
#define Z                             1447
#define OV                            1448
#define OVERFLOW                      1449
#define N                             1450
#define NEGATIVE                      1451
#define FSR2L                         1452
#define PLUSW2                        1453
#define PREINC2                       1454
#define POSTDEC2                      1455
#define POSTINC2                      1456
#define INDF2                         1457
#define FSR1L                         1458
#define PLUSW1                        1459
#define PREINC1                       1460
#define POSTDEC1                      1461
#define POSTINC1                      1462
#define INDF1                         1463
#define WREG                          1464
#define FSR0L                         1465
#define PLUSW0                        1466
#define PREINC0                       1467
#define POSTDEC0                      1468
#define POSTINC0                      1469
#define INDF0                         1470
#define INTCON3                       1471
#define INT1IF                        1472
#define INT1F                         1473
#define INT2IF                        1474
#define INT2F                         1475
#define INT3F                         1476
#define INT3IF                        1477
#define INT1E                         1478
#define INT1IE                        1479
#define INT2IE                        1480
#define INT2E                         1481
#define INT3E                         1482
#define INT3IE                        1483
#define INT1P                         1484
#define INT1IP                        1485
#define INT2IP                        1486
#define INT2P                         1487
#define INTCON2                       1488
#define RBIP                          1489
#define INT3IP                        1490
#define INT3P                         1491
#define TMR0IP                        1492
#define T0IP                          1493
#define INTEDG3                       1494
#define INTEDG2                       1495
#define INTEDG1                       1496
#define INTEDG0                       1497
#define RBPU                          1498
#define NOT_RBPU                      1499
#define nRBPU                         1500
#define INTCON                        1501
#define RBIF                          1502
#define INT0F                         1503
#define INT0IF                        1504
#define T0IF                          1505
#define TMR0IF                        1506
#define RBIE                          1507
#define INT0E                         1508
#define INT0IE                        1509
#define T0IE                          1510
#define TMR0IE                        1511
#define PEIE                          1512
#define PEIE_GIEL                     1513
#define GIEL                          1514
#define GIE_GIEH                      1515
#define GIE                           1516
#define GIEH                          1517
#define PRODL                         1518
#define PRODH                         1519
#define TABLAT                        1520
#define TBLPTRL                       1521
#define TBLPTRH                       1522
#define PCL                           1523
#define PCLATH                        1524
#define PCH                           1525
#define SP0                           1526
#define STKPTR                        1527
#define STKPTR0                       1528
#define SP1                           1529
#define STKPTR1                       1530
#define STKPTR2                       1531
#define SP2                           1532
#define SP3                           1533
#define STKPTR3                       1534
#define STKPTR4                       1535
#define SP4                           1536
#define STKUNF                        1537
#define STKOVF                        1538
#define STKFUL                        1539
#define TOSL                          1540
#define TOSH                          1541

#endif // _PIC18F87J72_H_
